src/posts/strict-group-theory.lagda.org
#+TITLE: Strictly Associative Group Theory

#+HTML_HEAD_EXTRA: <meta name="viewport" content="width=device-width, initial-scale=1">
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../style.css" />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./style-posts.css" />

#+HEADER: :exports none
#+begin_src agda2
open import Algebra.Bundles using (Group)
module _ {𝓖 : Group} where

open Group 𝓖

open import Relation.Binary.Reasoning.Setoid setoid
#+end_src

* Introduction

Commonly, when one starts to learn group theory, they are given the axioms for a group and then shown a very basic proof which very carefully uses these axioms. As an example, one might show that the identity of a group is unique:

#+begin_src agda2
identityˡ-unique : ∀ x y → x ∙ y ≈ y → x ≈ ε
identityˡ-unique x y eq = begin
  x              ≈˘⟨ identityʳ x ⟩
  x ∙ ε          ≈˘⟨ ∙-congˡ (inverseʳ y) ⟩
  x ∙ (y ∙ y ⁻¹) ≈˘⟨ assoc x y (y ⁻¹) ⟩
  (x ∙ y) ∙ y ⁻¹ ≈⟨ ∙-congʳ eq ⟩
       y  ∙ y ⁻¹ ≈⟨ inverseʳ y ⟩
  ε              ∎
#+end_src

This works nicely for some small examples but as proofs get more complicated, a lot of the proof becomes moving brackets around and adding units, which can be considered boilerplate and obscures the interesting parts of the proof.

Instead of tackling these problems in group theory, it is usual to sweep all of these problems under the rug, not write any brackets anywhere, and assume that all the associativity problems could be solved if needed. Luckily for group theorists, it is rarely necessary to worry about these details. Unfortunately if instead we are interested in formalising some group theory, in a proof assistant such as [[https://github.com/agda/agda][Agda]], then this all becomes very necessary, as the computer does not trust us that all the associativity problems are unnecessary.

In this post, a method in which this "bracketless group theory" can be written in a proof assistant is presented, and some of the difficulties with this are described.

* The Idea

The key concept that will be used is that there are two different types of equality in Type Theory (which is the perspective taken for this post). The first type is propositional equality, which is written as ~≈~ above. ~A ≈ B~ effectively means that we can prove that ~A~ and ~B~ are equal. The second type of equality is definitional equality or judgmental equality. This is stronger than propositional equality and if two objects are definitionally equal it means that they are the same objects (or at least have the same normal form in the type theory).

What we had above was a propositional equality between
#+begin_src agda2
(x ∙ y) ∙ z
#+end_src
and
#+begin_src agda2
x ∙ (y ∙ z)
#+end_src
when what we really want is for this to be a definitional equality, which would allow us to treat these as the same object. We say that we have /strict associativity/ exactly when this equation holds by definition. Luckily there is such a structure that has this property, namely function composition. Suppose we have functions ~f g h : X → X~. Then we have
#+begin_src agda2
(f ∘ g) ∘ h = f ∘ (g ∘ h) = λ x → f (g (h x))
#+end_src
Therefore we can work with functions without ever having to worry about associativity problems. We can also note that we also eliminate the need for any identity laws with functions as for all sets ~X~, we have an identity function ~id : X → X~ with
#+begin_src agda2
f ∘ id = id ∘ f = f
#+end_src

We say a structure has /strict units/ or is /strictly unital/ when this property holds.

** Cayley's Theorem
   Cayley's theorem gives us a translation from group operations to function composition. To understand what is says, we first need to introduce the notion of the symmetric group.

   #+begin_definition
   Given a set ~X~, the symmetric group on ~X~, written ~Sym(X)~, is the group whose elements are permutations on ~X~, operation is function composition, and inverses and identity are given by inverse and identity permutations.
   #+end_definition

   The important thing of note here is that the group operation in the symmetric group is function composition, just as we wanted. We can now state Cayley's Theorem:

   #+begin_theorem
   Given a group ~G~, there is an embedding (an injective homomorphism) from ~G~ into ~Sym(G)~.
   #+end_theorem

   #+begin_proof
   Sketch: Define a homomorphism ~⟦_⟧ : G → Sym(G)~ by ~⟦ g ⟧ = λ x → g ∙ x~. It is then routine to show that ~⟦_⟧~ is well defined (~⟦ g ⟧~ is a permutation for each ~g~), is a homomorphism, and is injective.
   #+end_proof

   Suppose we want to prove ~e₁ ≈ e₂~. The plan is to do the following steps.

   + Embed ~e₁~ and ~e₂~ into ~Sym(G)~ with ~⟦_⟧~
   + Prove that ~⟦ e₁ ⟧~ and ~⟦ e₂ ⟧~ are equal as functions, with the benefit that function composition is strictly associative and unital.
   + Use injectivity to get that ~e₁ ≈ e₂~

