_site/posts/strict-group-theory.lagda.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-27 Fri 12:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Strictly Associative Group Theory</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../style.css" />
<link rel="stylesheet" type="text/css" href="./style-posts.css" />
<meta name="viewport" content="width=device-width, initial-scale=1">
</head>
<body>
<div id="content">
<h1 class="title">Strictly Associative Group Theory</h1>

<div id="outline-container-org6544bde" class="outline-2">
<h2 id="org6544bde">Introduction</h2>
<div class="outline-text-2" id="text-org6544bde">
<p>
Commonly, when one starts to learn group theory, they are given the axioms for a group and then shown a very basic proof which very carefully uses these axioms. As an example, one might show that the identity of a group is unique:
</p>

<div class="org-src-container">
<pre class="src src-agda2">identity&#737;-unique : &#8704; x y &#8594; x &#8729; y &#8776; y &#8594; x &#8776; &#949;
identity&#737;-unique x y eq = begin
  x              &#8776;&#728;<span style="color: #61bfff;">&#10216;</span> identity&#691; x <span style="color: #61bfff;">&#10217;</span>
  x &#8729; &#949;          &#8776;&#728;<span style="color: #61bfff;">&#10216;</span> &#8729;-cong&#737; <span style="color: #ff79c6;">(</span>inverse&#691; y<span style="color: #ff79c6;">)</span> <span style="color: #61bfff;">&#10217;</span>
  x &#8729; <span style="color: #61bfff;">(</span>y &#8729; y &#8315;&#185;<span style="color: #61bfff;">)</span> &#8776;&#728;<span style="color: #61bfff;">&#10216;</span> assoc x y <span style="color: #ff79c6;">(</span>y &#8315;&#185;<span style="color: #ff79c6;">)</span> <span style="color: #61bfff;">&#10217;</span>
  <span style="color: #61bfff;">(</span>x &#8729; y<span style="color: #61bfff;">)</span> &#8729; y &#8315;&#185; &#8776;<span style="color: #61bfff;">&#10216;</span> &#8729;-cong&#691; eq <span style="color: #61bfff;">&#10217;</span>
       y  &#8729; y &#8315;&#185; &#8776;<span style="color: #61bfff;">&#10216;</span> inverse&#691; y <span style="color: #61bfff;">&#10217;</span>
  &#949;              &#8718;
</pre>
</div>

<p>
This works nicely for some small examples but as proofs get more complicated, a lot of the proof becomes moving brackets around and adding units, which can be considered boilerplate and obscures the interesting parts of the proof.
</p>

<p>
Instead of tackling these problems in group theory, it is usual to sweep all of these problems under the rug, not write any brackets anywhere, and assume that all the associativity problems could be solved if needed. Luckily for group theorists, it is rarely necessary to worry about these details. Unfortunately if instead we are interested in formalising some group theory, in a proof assistant such as <a href="https://github.com/agda/agda">Agda</a>, then this all becomes very necessary, as the computer does not trust us that all the associativity problems are unnecessary.
</p>

<p>
In this post, a method in which this "bracketless group theory" can be written in a proof assistant is presented, and some of the difficulties with this are described.
</p>
</div>
</div>

<div id="outline-container-orgaf9d66b" class="outline-2">
<h2 id="orgaf9d66b">The Idea</h2>
<div class="outline-text-2" id="text-orgaf9d66b">
<p>
The key concept that will be used is that there are two different types of equality in Type Theory (which is the perspective taken for this post). The first type is propositional equality, which is written as <code>≈</code> above. <code>A ≈ B</code> effectively means that we can prove that <code>A</code> and <code>B</code> are equal. The second type of equality is definitional equality or judgmental equality. This is stronger than propositional equality and if two objects are definitionally equal it means that they are the same objects (or at least have the same normal form in the type theory).
</p>

<p>
What we had above was a propositional equality between
</p>
<div class="org-src-container">
<pre class="src src-agda2"><span style="color: #61bfff;">(</span>x &#8729; y<span style="color: #61bfff;">)</span> &#8729; z
</pre>
</div>
<p>
and
</p>
<div class="org-src-container">
<pre class="src src-agda2">x &#8729; <span style="color: #61bfff;">(</span>y &#8729; z<span style="color: #61bfff;">)</span>
</pre>
</div>
<p>
when what we really want is for this to be a definitional equality, which would allow us to treat these as the same object. We say that we have <i>strict associativity</i> exactly when this equation holds by definition. Luckily there is such a structure that has this property, namely function composition. Suppose we have functions <code>f g h : X → X</code>. Then we have
</p>
<div class="org-src-container">
<pre class="src src-agda2"><span style="color: #61bfff;">(</span>f &#8728; g<span style="color: #61bfff;">)</span> &#8728; h = f &#8728; <span style="color: #61bfff;">(</span>g &#8728; h<span style="color: #61bfff;">)</span> = &#955; x &#8594; f <span style="color: #61bfff;">(</span>g <span style="color: #ff79c6;">(</span>h x<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
<p>
Therefore we can work with functions without ever having to worry about associativity problems. We can also note that we also eliminate the need for any identity laws with functions as for all sets <code>X</code>, we have an identity function <code>id : X → X</code> with
</p>
<div class="org-src-container">
<pre class="src src-agda2">f &#8728; id = id &#8728; f = f
</pre>
</div>

<p>
We say a structure has <i>strict units</i> or is <i>strictly unital</i> when this property holds.
</p>
</div>

<div id="outline-container-orgb9b9b30" class="outline-3">
<h3 id="orgb9b9b30">Cayley's Theorem</h3>
<div class="outline-text-3" id="text-orgb9b9b30">
<p>
Cayley's theorem gives us a translation from group operations to function composition. To understand what is says, we first need to introduce the notion of the symmetric group.
</p>

<div class="definition">
<p>
Given a set <code>X</code>, the symmetric group on <code>X</code>, written <code>Sym(X)</code>, is the group whose elements are permutations on <code>X</code>, operation is function composition, and inverses and identity are given by inverse and identity permutations.
</p>

</div>

<p>
The important thing of note here is that the group operation in the symmetric group is function composition, just as we wanted. We can now state Cayley's Theorem:
</p>

<div class="theorem">
<p>
Given a group <code>G</code>, there is an embedding (an injective homomorphism) from <code>G</code> into <code>Sym(G)</code>.
</p>

</div>

<div class="proof">
<p>
Sketch: Define a homomorphism <code>⟦_⟧ : G → Sym(G)</code> by <code>⟦ g ⟧ = λ x → g ∙ x</code>. It is then routine to show that <code>⟦_⟧</code> is well defined (<code>⟦ g ⟧</code> is a permutation for each <code>g</code>), is a homomorphism, and is injective.
</p>

</div>

<p>
Suppose we want to prove <code>e₁ ≈ e₂</code>. The plan is to do the following steps.
</p>

<ul class="org-ul">
<li>Embed <code>e₁</code> and <code>e₂</code> into <code>Sym(G)</code> with <code>⟦_⟧</code></li>
<li>Prove that <code>⟦ e₁ ⟧</code> and <code>⟦ e₂ ⟧</code> are equal as functions, with the benefit that function composition is strictly associative and unital.</li>
<li>Use injectivity to get that <code>e₁ ≈ e₂</code></li>
</ul>
</div>
</div>
</div>
