src/posts/strict-group-theory.lagda.org
* Implementation
  All the ideas above have been implemented in [[https://github.com/alexarice/Groups][https://github.com/alexarice/Groups]]. The corresponding version of the proof in the introduction is:

  #+begin_src agda2
  identity-is-unique-strong : ∀ a b → a ∙ b ≈ b → a ≈ ε
  identity-is-unique-strong a b p = begin⟨ ⟦⟧ ⟩
  ⟦ a ⟧                       ∘⟨⟩≣˘⟨ invʳ ⟦ b ⟧ ⟩
  ⟨ ⟦ a ⟧ ∘ ⟦ b ⟧ ⟩∘ inv ⟦ b ⟧   ≣⟨ ⟨ ⟦⟧ ⟩⦅ p ⦆ ⟩
  ⟨ ⟦ b ⟧ ∘ inv ⟦ b ⟧           ⟩≣⟨ invʳ ⟦ b ⟧ ⟩
  id                              ∎
  #+end_src

  As a second example, here is the proof of left cancellation:

  #+begin_src agda2
  left-cancellation : ∀ g h x → x ∙ g ≈ x ∙ h → g ≈ h
  left-cancellation g h x p = begin⟨ ⟦⟧ ⟩
    ⟨⟩∘ ⟦ g ⟧ ≣˘⟨ invˡ ⟦ x ⟧ ⟩
    inv ⟦ x ⟧ ∘⟨ ⟦ x ⟧ ∘ ⟦ g ⟧ ⟩≣⟨ ⟨ ⟦⟧ ⟩⦅ p ⦆ ⟩
    ⟨ inv ⟦ x ⟧ ∘ ⟦ x ⟧ ⟩∘ ⟦ h ⟧ ≣⟨ invˡ ⟦ x ⟧ ⟩
    ⟦ h ⟧ ∎
  #+end_src

  and that the inverse operation is an anti homomorphism on the group operation:

  #+begin_src agda2
  inv-of-composite : ∀ g h → (g ∙ h) ⁻¹ ≈ h ⁻¹ ∙ g ⁻¹
  inv-of-composite g h = begin⟨ ⟦⟧ ⟩
    inv (⟦ g ⟧ ∘ ⟦ h ⟧) ∘⟨⟩≣˘⟨ invʳ ⟦ g ⟧ ⟩
    inv (⟦ g ⟧ ∘ ⟦ h ⟧) ∘ ⟦ g ⟧ ∘⟨⟩∘ inv ⟦ g ⟧ ≣˘⟨ invʳ ⟦ h ⟧ ⟩
    ⟨ inv (⟦ g ⟧ ∘ ⟦ h ⟧) ∘ (⟦ g ⟧ ∘ ⟦ h ⟧) ⟩∘ inv ⟦ h ⟧ ∘ inv ⟦ g ⟧
      ≣⟨ invˡ (⟦ g ⟧ ∘ ⟦ h ⟧) ⟩
    inv ⟦ h ⟧ ∘ inv ⟦ g ⟧ ∎
  #+end_src

  The rest of the post will be explaining the code above.

** Elimination of cong
   Perhaps the most obvious change from the original code is the addition of the angle brackets ~⟨~ and ~⟩~. These allow us to apply an equality to a part of the expression we are working on. Instead of having to manually use a ~cong~ function to manipulate the equality (as well as making it unreadable), we instead use the syntax above which allows the appropriate equalities to be automatically put in.

   This is made possible due to the simplicity of the expressions. As each expression is now effectively a finite list of functions, it becomes very easy to split it into a focus, which we manipulate, as well as expressions that occur before and after the focus.

** Strict associativity and unitality
   The above proof shows that the need for associativity operations has been removed. The result of the first equality in the proof is:

#+begin_src agda2
⟦ a ⟧ ∘ (⟦ b ⟧ ∘ inv ⟦ b ⟧)
#+end_src

and yet in the next line we treat it as:

#+begin_src agda2
(⟦ a ⟧ ∘ ⟦ b ⟧) ∘ inv ⟦ b ⟧
#+end_src

without telling Agda how to deal with this. This is possible as the terms have the same normal form (this is not actually true, see [[Equality between functions][here]]).

We can also see that unitality has been taken care of. In the first line it has been implicitly assumed that an identity can be inserted on the right of the expression.

