_site/posts/strict-group-theory.lagda.html

<div id="outline-container-org70f6c3a" class="outline-2">
<h2 id="org70f6c3a">Implementation</h2>
<div class="outline-text-2" id="text-org70f6c3a">
<p>
All the ideas above have been implemented in <a href="https://github.com/alexarice/Groups">https://github.com/alexarice/Groups</a>. The corresponding version of the proof in the introduction is:
</p>

<div class="org-src-container">
<pre class="src src-agda2">identity-is-unique-strong : &#8704; a b &#8594; a &#8729; b &#8776; b &#8594; a &#8776; &#949;
identity-is-unique-strong a b p = begin<span style="color: #61bfff;">&#10216;</span> <span style="color: #ff79c6;">&#10214;&#10215;</span> <span style="color: #61bfff;">&#10217;</span>
<span style="color: #61bfff;">&#10214;</span> a <span style="color: #61bfff;">&#10215;</span>                       &#8728;<span style="color: #61bfff;">&#10216;&#10217;</span>&#8803;&#728;<span style="color: #61bfff;">&#10216;</span> inv&#691; <span style="color: #ff79c6;">&#10214;</span> b <span style="color: #ff79c6;">&#10215;</span> <span style="color: #61bfff;">&#10217;</span>
<span style="color: #61bfff;">&#10216;</span> <span style="color: #ff79c6;">&#10214;</span> a <span style="color: #ff79c6;">&#10215;</span> &#8728; <span style="color: #ff79c6;">&#10214;</span> b <span style="color: #ff79c6;">&#10215;</span> <span style="color: #61bfff;">&#10217;</span>&#8728; inv <span style="color: #61bfff;">&#10214;</span> b <span style="color: #61bfff;">&#10215;</span>   &#8803;<span style="color: #61bfff;">&#10216;</span> <span style="color: #ff79c6;">&#10216;</span> <span style="color: #50fa7b;">&#10214;&#10215;</span> <span style="color: #ff79c6;">&#10217;&#10629;</span> p <span style="color: #ff79c6;">&#10630;</span> <span style="color: #61bfff;">&#10217;</span>
<span style="color: #61bfff;">&#10216;</span> <span style="color: #ff79c6;">&#10214;</span> b <span style="color: #ff79c6;">&#10215;</span> &#8728; inv <span style="color: #ff79c6;">&#10214;</span> b <span style="color: #ff79c6;">&#10215;</span>           <span style="color: #61bfff;">&#10217;</span>&#8803;<span style="color: #61bfff;">&#10216;</span> inv&#691; <span style="color: #ff79c6;">&#10214;</span> b <span style="color: #ff79c6;">&#10215;</span> <span style="color: #61bfff;">&#10217;</span>
id                              &#8718;
</pre>
</div>

<p>
As a second example, here is the proof of left cancellation:
</p>

<div class="org-src-container">
<pre class="src src-agda2">left-cancellation : &#8704; g h x &#8594; x &#8729; g &#8776; x &#8729; h &#8594; g &#8776; h
left-cancellation g h x p = begin<span style="color: #61bfff;">&#10216;</span> <span style="color: #ff79c6;">&#10214;&#10215;</span> <span style="color: #61bfff;">&#10217;</span>
  <span style="color: #61bfff;">&#10216;&#10217;</span>&#8728; <span style="color: #61bfff;">&#10214;</span> g <span style="color: #61bfff;">&#10215;</span> &#8803;&#728;<span style="color: #61bfff;">&#10216;</span> inv&#737; <span style="color: #ff79c6;">&#10214;</span> x <span style="color: #ff79c6;">&#10215;</span> <span style="color: #61bfff;">&#10217;</span>
  inv <span style="color: #61bfff;">&#10214;</span> x <span style="color: #61bfff;">&#10215;</span> &#8728;<span style="color: #61bfff;">&#10216;</span> <span style="color: #ff79c6;">&#10214;</span> x <span style="color: #ff79c6;">&#10215;</span> &#8728; <span style="color: #ff79c6;">&#10214;</span> g <span style="color: #ff79c6;">&#10215;</span> <span style="color: #61bfff;">&#10217;</span>&#8803;<span style="color: #61bfff;">&#10216;</span> <span style="color: #ff79c6;">&#10216;</span> <span style="color: #50fa7b;">&#10214;&#10215;</span> <span style="color: #ff79c6;">&#10217;&#10629;</span> p <span style="color: #ff79c6;">&#10630;</span> <span style="color: #61bfff;">&#10217;</span>
  <span style="color: #61bfff;">&#10216;</span> inv <span style="color: #ff79c6;">&#10214;</span> x <span style="color: #ff79c6;">&#10215;</span> &#8728; <span style="color: #ff79c6;">&#10214;</span> x <span style="color: #ff79c6;">&#10215;</span> <span style="color: #61bfff;">&#10217;</span>&#8728; <span style="color: #61bfff;">&#10214;</span> h <span style="color: #61bfff;">&#10215;</span> &#8803;<span style="color: #61bfff;">&#10216;</span> inv&#737; <span style="color: #ff79c6;">&#10214;</span> x <span style="color: #ff79c6;">&#10215;</span> <span style="color: #61bfff;">&#10217;</span>
  <span style="color: #61bfff;">&#10214;</span> h <span style="color: #61bfff;">&#10215;</span> &#8718;
</pre>
</div>

<p>
and that the inverse operation is an anti homomorphism on the group operation:
</p>

<div class="org-src-container">
<pre class="src src-agda2">inv-of-composite : &#8704; g h &#8594; <span style="color: #61bfff;">(</span>g &#8729; h<span style="color: #61bfff;">)</span> &#8315;&#185; &#8776; h &#8315;&#185; &#8729; g &#8315;&#185;
inv-of-composite g h = begin<span style="color: #61bfff;">&#10216;</span> <span style="color: #ff79c6;">&#10214;&#10215;</span> <span style="color: #61bfff;">&#10217;</span>
  inv <span style="color: #61bfff;">(</span><span style="color: #ff79c6;">&#10214;</span> g <span style="color: #ff79c6;">&#10215;</span> &#8728; <span style="color: #ff79c6;">&#10214;</span> h <span style="color: #ff79c6;">&#10215;</span><span style="color: #61bfff;">)</span> &#8728;<span style="color: #61bfff;">&#10216;&#10217;</span>&#8803;&#728;<span style="color: #61bfff;">&#10216;</span> inv&#691; <span style="color: #ff79c6;">&#10214;</span> g <span style="color: #ff79c6;">&#10215;</span> <span style="color: #61bfff;">&#10217;</span>
  inv <span style="color: #61bfff;">(</span><span style="color: #ff79c6;">&#10214;</span> g <span style="color: #ff79c6;">&#10215;</span> &#8728; <span style="color: #ff79c6;">&#10214;</span> h <span style="color: #ff79c6;">&#10215;</span><span style="color: #61bfff;">)</span> &#8728; <span style="color: #61bfff;">&#10214;</span> g <span style="color: #61bfff;">&#10215;</span> &#8728;<span style="color: #61bfff;">&#10216;&#10217;</span>&#8728; inv <span style="color: #61bfff;">&#10214;</span> g <span style="color: #61bfff;">&#10215;</span> &#8803;&#728;<span style="color: #61bfff;">&#10216;</span> inv&#691; <span style="color: #ff79c6;">&#10214;</span> h <span style="color: #ff79c6;">&#10215;</span> <span style="color: #61bfff;">&#10217;</span>
  <span style="color: #61bfff;">&#10216;</span> inv <span style="color: #ff79c6;">(</span><span style="color: #50fa7b;">&#10214;</span> g <span style="color: #50fa7b;">&#10215;</span> &#8728; <span style="color: #50fa7b;">&#10214;</span> h <span style="color: #50fa7b;">&#10215;</span><span style="color: #ff79c6;">)</span> &#8728; <span style="color: #ff79c6;">(</span><span style="color: #50fa7b;">&#10214;</span> g <span style="color: #50fa7b;">&#10215;</span> &#8728; <span style="color: #50fa7b;">&#10214;</span> h <span style="color: #50fa7b;">&#10215;</span><span style="color: #ff79c6;">)</span> <span style="color: #61bfff;">&#10217;</span>&#8728; inv <span style="color: #61bfff;">&#10214;</span> h <span style="color: #61bfff;">&#10215;</span> &#8728; inv <span style="color: #61bfff;">&#10214;</span> g <span style="color: #61bfff;">&#10215;</span>
    &#8803;<span style="color: #61bfff;">&#10216;</span> inv&#737; <span style="color: #ff79c6;">(</span><span style="color: #50fa7b;">&#10214;</span> g <span style="color: #50fa7b;">&#10215;</span> &#8728; <span style="color: #50fa7b;">&#10214;</span> h <span style="color: #50fa7b;">&#10215;</span><span style="color: #ff79c6;">)</span> <span style="color: #61bfff;">&#10217;</span>
  inv <span style="color: #61bfff;">&#10214;</span> h <span style="color: #61bfff;">&#10215;</span> &#8728; inv <span style="color: #61bfff;">&#10214;</span> g <span style="color: #61bfff;">&#10215;</span> &#8718;
</pre>
</div>

<p>
The rest of the post will be explaining the code above.
</p>
</div>

<div id="outline-container-orgb78692c" class="outline-3">
<h3 id="orgb78692c">Elimination of cong</h3>
<div class="outline-text-3" id="text-orgb78692c">
<p>
Perhaps the most obvious change from the original code is the addition of the angle brackets <code>⟨</code> and <code>⟩</code>. These allow us to apply an equality to a part of the expression we are working on. Instead of having to manually use a <code>cong</code> function to manipulate the equality (as well as making it unreadable), we instead use the syntax above which allows the appropriate equalities to be automatically put in.
</p>

<p>
This is made possible due to the simplicity of the expressions. As each expression is now effectively a finite list of functions, it becomes very easy to split it into a focus, which we manipulate, as well as expressions that occur before and after the focus.
</p>
</div>
</div>

<div id="outline-container-org2f0fb45" class="outline-3">
<h3 id="org2f0fb45">Strict associativity and unitality</h3>
<div class="outline-text-3" id="text-org2f0fb45">
<p>
The above proof shows that the need for associativity operations has been removed. The result of the first equality in the proof is:
</p>

<div class="org-src-container">
<pre class="src src-agda2"><span style="color: #61bfff;">&#10214;</span> a <span style="color: #61bfff;">&#10215;</span> &#8728; <span style="color: #61bfff;">(</span><span style="color: #ff79c6;">&#10214;</span> b <span style="color: #ff79c6;">&#10215;</span> &#8728; inv <span style="color: #ff79c6;">&#10214;</span> b <span style="color: #ff79c6;">&#10215;</span><span style="color: #61bfff;">)</span>
</pre>
</div>

<p>
and yet in the next line we treat it as:
</p>

<div class="org-src-container">
<pre class="src src-agda2"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">&#10214;</span> a <span style="color: #ff79c6;">&#10215;</span> &#8728; <span style="color: #ff79c6;">&#10214;</span> b <span style="color: #ff79c6;">&#10215;</span><span style="color: #61bfff;">)</span> &#8728; inv <span style="color: #61bfff;">&#10214;</span> b <span style="color: #61bfff;">&#10215;</span>
</pre>
</div>

<p>
without telling Agda how to deal with this. This is possible as the terms have the same normal form (this is not actually true, see <a href="#orgaf905cb">here</a>).
</p>

<p>
We can also see that unitality has been taken care of. In the first line it has been implicitly assumed that an identity can be inserted on the right of the expression.
</p>
</div>
</div>
