src/posts/strict-group-theory.lagda.org
** Equality between functions
   The choice of equality between functions is crucial to making this syntax work. The complication is that we have said function composition is strictly associative but glossed over that we are working with permutations or invertible functions.

   Above, the ~∘~ operator is not just composition of functions, but is composition of invertible functions, which joins the proofs that each component is invertible to get a proof that the whole composite is invertible. It turns out this is /not/ a strictly associative operation. However if we make sure we only compare the function components of the invertible functions, then strict associativity returns.

   This would lead us to the following definition of equality between invertible functions.

#+begin_src agda2
_∼_ : Sym → Sym → Set
f ∼ g = to f ≃ to g
#+end_src

Where Sym is the type of permutations on the group and ~≃~ is pointwise equality of functions.

 This has the advantage that it does not remember any of the invertibility data and so we can have all the nice features mentioned above. However, it turns out that this forgets too much invertibility data, in that if the implementation is made with this equality, then Agda will complain everywhere about implicit arguments that it cannot resolve. The next thing we might try is to remember the invertibility data but do not check whether it is equal. This leads to the following definition.

#+begin_src agda2
record SymEq (f g : Sym) : Set where
  field
    eq : to f ≃ to g

_≣_ : Sym → Sym → Set
_≣_ = SymEq
#+end_src

This ends up being a nice form of equality which we use to define the symmetric group. Unfortunately, it runs into problems with invertibility data not lining up if we try to use it in the syntax above. It turns out we need another type of equality, where we only remember the invertibility data for the second argument. This clears all the implicit argument problems without introducing any associativity problems.

#+begin_src agda2
record PartSymEq (f : G ⟶ G) (g : Sym) : Set where
  field
    peq : f ≃ to g

_≣'_ : Sym → Sym → Set
f ≣' g = PartSymEq (to f) g
#+end_src

** Dealing with homomorphisms
   So far we have not covered the last step of the proof strategy, which was using injectivity transform function equality to group element equality. This is a very simple procedure, however it does not usually do what we want. Consider the proof that identities are unique. Injectivity gives us something of the form:

#+begin_src agda2
⟦ a ⟧ ≣ ⟦ ε ⟧ → a ≈ ε
#+end_src

but what we actually wanted was:

#+begin_src agda2
⟦ a ⟧ ≣ id → a ≈ ε
#+end_src

We also have the same problem going the opposite direction. In the proof we have an argument of the form:

#+begin_src agda2
a ∙ b ≈ b
#+end_src

If were naively transport this using the inclusion we would get:

#+begin_src agda2
⟦ a ∙ b ⟧ ≣ ⟦ b ⟧
#+end_src

when what we really wanted was:

#+begin_src agda2
⟦ a ⟧ ∘ ⟦ b ⟧ ≣ ⟦ b ⟧
#+end_src

The proofs that these imply each other are not too difficult but applying them to each case is tedious and makes the proofs more convoluted which defeats the original purpose of this construction. Therefore two reflection helpers have been made to automate this process. The first is ~⟨_⟩⦅_⦆~, which solves the second problem. This takes a homomorphism and an equality and applies as many homomorphism rules as possible to the equality. It does this by inspecting the terms of the left and right hand side using reflection and using this to work out which rules to apply.

#+begin_src agda2
test : ∀ a b → a ≈ b → ⟦ a ⟧ ≣ ⟦ b ⟧
test a b p = ⟨ ⟦⟧ ⟩⦅ p ⦆

test2 : ∀ a b → a ∙ b ≈ b → ⟦ a ⟧ ∘ ⟦ b ⟧ ≣ ⟦ b ⟧
test2 a b p = ⟨ ⟦⟧ ⟩⦅ p ⦆

test3 : ∀ x y z
      → x ∙ (y ⁻¹ ∙ ε) ≈ z ∙ z
      → ⟦ x ⟧ ∘ (inv ⟦ y ⟧ ∘ e) ≣ ⟦ z ⟧ ∘ ⟦ z ⟧
test3 x y z p = ⟨ ⟦⟧ ⟩⦅ p ⦆
#+end_src

The second reflection helper is wrapped in the ~begin⟨_⟩_~ function. This takes care of the first problem we had, again by using reflection to find the term needed and applying the appropriate rules to get the given proof in the form needed.

* Limitations
There are currently a few limitations with this system:
- The syntax is not ideal. One problem is that it currently seems necessary to pass the homomorphism into the reflection helper each time it is used though this is probably fixable. Something which is less fixable is the angle bracket syntax for dealing with congs being "stuck to" the equality symbol. This is caused by Agda syntax requiring that you alternate holes and non holes, where we would like to be able to put two non holes next to each other.
- The reflection helpers are very slow. In the current version of Agda (2.6.1), compiling these files is very slow which makes them painful to work with.
- Agda is not great at telling you what should go in a hole with this syntax. Where the reflection helpers are used, it will tell you it wants something of a type labelled by some mysterious number. Even when this isn't the case, the use of records for the permutations sometimes causes a mess when one tries to solve a hole.

* Thanks
Thanks goes to Martin Escardo, who suggested the possibility of using Cayley's Theorem and convinced me to write this post.
