_site/posts/strict-group-theory.lagda.html

<div id="outline-container-orgaf905cb" class="outline-3">
<h3 id="orgaf905cb">Equality between functions</h3>
<div class="outline-text-3" id="text-orgaf905cb">
<p>
The choice of equality between functions is crucial to making this syntax work. The complication is that we have said function composition is strictly associative but glossed over that we are working with permutations or invertible functions.
</p>

<p>
Above, the <code>∘</code> operator is not just composition of functions, but is composition of invertible functions, which joins the proofs that each component is invertible to get a proof that the whole composite is invertible. It turns out this is <i>not</i> a strictly associative operation. However if we make sure we only compare the function components of the invertible functions, then strict associativity returns.
</p>

<p>
This would lead us to the following definition of equality between invertible functions.
</p>

<div class="org-src-container">
<pre class="src src-agda2">_&#8764;_ : Sym &#8594; Sym &#8594; Set
f &#8764; g = to f &#8771; to g
</pre>
</div>

<p>
Where Sym is the type of permutations on the group and <code>≃</code> is pointwise equality of functions.
</p>

<p>
This has the advantage that it does not remember any of the invertibility data and so we can have all the nice features mentioned above. However, it turns out that this forgets too much invertibility data, in that if the implementation is made with this equality, then Agda will complain everywhere about implicit arguments that it cannot resolve. The next thing we might try is to remember the invertibility data but do not check whether it is equal. This leads to the following definition.
</p>

<div class="org-src-container">
<pre class="src src-agda2">record SymEq <span style="color: #61bfff;">(</span>f g : Sym<span style="color: #61bfff;">)</span> : Set where
  field
    eq : to f &#8771; to g

_&#8803;_ : Sym &#8594; Sym &#8594; Set
_&#8803;_ = SymEq
</pre>
</div>

<p>
This ends up being a nice form of equality which we use to define the symmetric group. Unfortunately, it runs into problems with invertibility data not lining up if we try to use it in the syntax above. It turns out we need another type of equality, where we only remember the invertibility data for the second argument. This clears all the implicit argument problems without introducing any associativity problems.
</p>

<div class="org-src-container">
<pre class="src src-agda2">record PartSymEq <span style="color: #61bfff;">(</span>f : G &#10230; G<span style="color: #61bfff;">)</span> <span style="color: #61bfff;">(</span>g : Sym<span style="color: #61bfff;">)</span> : Set where
  field
    peq : f &#8771; to g

_&#8803;'_ : Sym &#8594; Sym &#8594; Set
f &#8803;' g = PartSymEq <span style="color: #61bfff;">(</span>to f<span style="color: #61bfff;">)</span> g
</pre>
</div>
</div>
</div>

<div id="outline-container-org07aeb55" class="outline-3">
<h3 id="org07aeb55">Dealing with homomorphisms</h3>
<div class="outline-text-3" id="text-org07aeb55">
<p>
So far we have not covered the last step of the proof strategy, which was using injectivity transform function equality to group element equality. This is a very simple procedure, however it does not usually do what we want. Consider the proof that identities are unique. Injectivity gives us something of the form:
</p>

<div class="org-src-container">
<pre class="src src-agda2"><span style="color: #61bfff;">&#10214;</span> a <span style="color: #61bfff;">&#10215;</span> &#8803; <span style="color: #61bfff;">&#10214;</span> &#949; <span style="color: #61bfff;">&#10215;</span> &#8594; a &#8776; &#949;
</pre>
</div>

<p>
but what we actually wanted was:
</p>

<div class="org-src-container">
<pre class="src src-agda2"><span style="color: #61bfff;">&#10214;</span> a <span style="color: #61bfff;">&#10215;</span> &#8803; id &#8594; a &#8776; &#949;
</pre>
</div>

<p>
We also have the same problem going the opposite direction. In the proof we have an argument of the form:
</p>

<div class="org-src-container">
<pre class="src src-agda2">a &#8729; b &#8776; b
</pre>
</div>

<p>
If were naively transport this using the inclusion we would get:
</p>

<div class="org-src-container">
<pre class="src src-agda2"><span style="color: #61bfff;">&#10214;</span> a &#8729; b <span style="color: #61bfff;">&#10215;</span> &#8803; <span style="color: #61bfff;">&#10214;</span> b <span style="color: #61bfff;">&#10215;</span>
</pre>
</div>

<p>
when what we really wanted was:
</p>

<div class="org-src-container">
<pre class="src src-agda2"><span style="color: #61bfff;">&#10214;</span> a <span style="color: #61bfff;">&#10215;</span> &#8728; <span style="color: #61bfff;">&#10214;</span> b <span style="color: #61bfff;">&#10215;</span> &#8803; <span style="color: #61bfff;">&#10214;</span> b <span style="color: #61bfff;">&#10215;</span>
</pre>
</div>

<p>
The proofs that these imply each other are not too difficult but applying them to each case is tedious and makes the proofs more convoluted which defeats the original purpose of this construction. Therefore two reflection helpers have been made to automate this process. The first is <code>⟨_⟩⦅_⦆</code>, which solves the second problem. This takes a homomorphism and an equality and applies as many homomorphism rules as possible to the equality. It does this by inspecting the terms of the left and right hand side using reflection and using this to work out which rules to apply.
</p>

<div class="org-src-container">
<pre class="src src-agda2">test : &#8704; a b &#8594; a &#8776; b &#8594; <span style="color: #61bfff;">&#10214;</span> a <span style="color: #61bfff;">&#10215;</span> &#8803; <span style="color: #61bfff;">&#10214;</span> b <span style="color: #61bfff;">&#10215;</span>
test a b p = <span style="color: #61bfff;">&#10216;</span> <span style="color: #ff79c6;">&#10214;&#10215;</span> <span style="color: #61bfff;">&#10217;&#10629;</span> p <span style="color: #61bfff;">&#10630;</span>

test2 : &#8704; a b &#8594; a &#8729; b &#8776; b &#8594; <span style="color: #61bfff;">&#10214;</span> a <span style="color: #61bfff;">&#10215;</span> &#8728; <span style="color: #61bfff;">&#10214;</span> b <span style="color: #61bfff;">&#10215;</span> &#8803; <span style="color: #61bfff;">&#10214;</span> b <span style="color: #61bfff;">&#10215;</span>
test2 a b p = <span style="color: #61bfff;">&#10216;</span> <span style="color: #ff79c6;">&#10214;&#10215;</span> <span style="color: #61bfff;">&#10217;&#10629;</span> p <span style="color: #61bfff;">&#10630;</span>

test3 : &#8704; x y z
      &#8594; x &#8729; <span style="color: #61bfff;">(</span>y &#8315;&#185; &#8729; &#949;<span style="color: #61bfff;">)</span> &#8776; z &#8729; z
      &#8594; <span style="color: #61bfff;">&#10214;</span> x <span style="color: #61bfff;">&#10215;</span> &#8728; <span style="color: #61bfff;">(</span>inv <span style="color: #ff79c6;">&#10214;</span> y <span style="color: #ff79c6;">&#10215;</span> &#8728; e<span style="color: #61bfff;">)</span> &#8803; <span style="color: #61bfff;">&#10214;</span> z <span style="color: #61bfff;">&#10215;</span> &#8728; <span style="color: #61bfff;">&#10214;</span> z <span style="color: #61bfff;">&#10215;</span>
test3 x y z p = <span style="color: #61bfff;">&#10216;</span> <span style="color: #ff79c6;">&#10214;&#10215;</span> <span style="color: #61bfff;">&#10217;&#10629;</span> p <span style="color: #61bfff;">&#10630;</span>
</pre>
</div>

<p>
The second reflection helper is wrapped in the <code>begin⟨_⟩_</code> function. This takes care of the first problem we had, again by using reflection to find the term needed and applying the appropriate rules to get the given proof in the form needed.
</p>
</div>
</div>
</div>

<div id="outline-container-org96319d4" class="outline-2">
<h2 id="org96319d4">Limitations</h2>
<div class="outline-text-2" id="text-org96319d4">
<p>
There are currently a few limitations with this system:
</p>
<ul class="org-ul">
<li>The syntax is not ideal. One problem is that it currently seems necessary to pass the homomorphism into the reflection helper each time it is used though this is probably fixable. Something which is less fixable is the angle bracket syntax for dealing with congs being "stuck to" the equality symbol. This is caused by Agda syntax requiring that you alternate holes and non holes, where we would like to be able to put two non holes next to each other.</li>
<li>The reflection helpers are very slow. In the current version of Agda (2.6.1), compiling these files is very slow which makes them painful to work with.</li>
<li>Agda is not great at telling you what should go in a hole with this syntax. Where the reflection helpers are used, it will tell you it wants something of a type labelled by some mysterious number. Even when this isn't the case, the use of records for the permutations sometimes causes a mess when one tries to solve a hole.</li>
</ul>
</div>
</div>

<div id="outline-container-org66f7b12" class="outline-2">
<h2 id="org66f7b12">Thanks</h2>
<div class="outline-text-2" id="text-org66f7b12">
<p>
Thanks goes to Martin Escardo, who suggested the possibility of using Cayley's Theorem and convinced me to write this post.
</p>
</div>
</div>
</div>
</body>
</html>
